ChannelConjugateHeatV4/aero/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (10 0 0);

boundaryField
{
    hot_air_in
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    hot_air_out
    {
        type            inletOutlet;
        inletValue      uniform (10 0 0);
        value           $internalField;
    }
    cold_air_in
    {
        type            fixedValue;
        value           uniform (-10 0 0);
    }
    cold_air_out
    {
        type            inletOutlet;
        inletValue      uniform (-10 0 0);
        value           $internalField;
    }
    "(.*_outer|.*_inner|.*_sides)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
