ChannelConjugateHeatV4/aero/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 1e-3;

boundaryField
{
    hot_air_in
    {
        type            fixedValue;
        value           $internalField;
    }
    hot_air_out
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    cold_air_in
    {
        type            fixedValue;
        value           $internalField;
    }
    cold_air_out
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "(.*_outer|.*_inner|.*_sides)"
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
}


// ************************************************************************* //
